---
kind: method
id: M:Autodesk.Revit.DB.DefaultDivideSettings.GetDefaultDivideSettings(Autodesk.Revit.DB.Document)
source: html/6919eb7d-3c9b-a1ad-9a73-3cc0e0b357d8.htm
---
# Autodesk.Revit.DB.DefaultDivideSettings.GetDefaultDivideSettings Method

Obtains the DefaultDivideSettings object for the specified document.

## Syntax (C#)
```csharp
public static DefaultDivideSettings GetDefaultDivideSettings(
	Document cda
)
```

## Parameters
- **cda** (`Autodesk.Revit.DB.Document`) - A document.

## Returns
The DefaultDivideSettings object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null